test/artillery/load-test.yaml
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

config:
  target: "http://178.33.230.78"
  socketio:
    path: "/socket-chatbot"
    transports: ["websocket"]
  phases:
    - duration: 60
      arrivalRate: 1
    - duration: 120
      arrivalRate: 5
    - duration: 60
      arrivalRate: 10
  processor: "./functions.js"

scenarios:
  - name: "A user that just lurks"
    weight: 50
    engine: "socketio"
    flow:
      - emit:
          channel: "session_request"
          data: {session_id: null}
          response:
            channel: "session_confirm"
      - think: 60

  - name: "A mostly quiet user"
    weight: 25
    engine: "socketio"
    flow:
      - emit:
          channel: "session_request"
          data: {session_id: null}
          response:
            channel: "session_confirm"
            capture:
              regexp: '[\s\S]+'
              transform: "this.sessionId.replace(/\"/g, '')"
              as: "sessionId"
      - think: 5
      - function: "setMessage"
      - emit:
          channel: "user_uttered"
          data: {"message": "{{ message }}", "session_id": "{{ sessionId }}"}
          response:
            channel: "bot_uttered"
      - think: 60

  - name: "A chatty user"
    weight: 25
    engine: "socketio"
    flow:
      - emit:
          channel: "session_request"
          data: {session_id: null}
          response:
            channel: "session_confirm"
            capture:
              regexp: '[\s\S]+'
              transform: "this.sessionId.replace(/\"/g, '')"
              as: "sessionId"
      - loop:
          - function: "setMessage"
          - emit:
              channel: "user_uttered"
              data: {"message": "{{ message }}", "session_id": "{{ sessionId }}"}
              response:
                channel: "bot_uttered"
          - think: 10
        count: 10