test/artillery/load-test.yaml
# This Source Code Form is subject to the terms of the Mozilla Public
# License, v. 2.0. If a copy of the MPL was not distributed with this
# file, You can obtain one at http://mozilla.org/MPL/2.0/.

config:
  target: "https://dev.chatbot.fabnum.fr"
  socketio:
    path: "/socket-chatbot"
    transports: ["websocket"]
  phases:
    - duration: 120
      arrivalRate: 1
    - duration: 120
      arrivalRate: 5
    - duration: 120
      arrivalRate: 10
    - duration: 120
      arrivalRate: 30
  processor: "./functions.js"
  engines:
    socketio-v3: { }

scenarios:
  - name: "A user that just lurks"
    weight: 100
    engine: socketio-v3
    flow:
      - emit:
          channel: "session_request"
          data: { session_id: null }
      - think: 120

#  - name: "A mostly quiet user"
#    weight: 0
#    engine: "socketio"
#    flow:
#      - emit:
#          channel: "session_request"
#          data: {session_id: null}
#      - think: 5
#      - function: "setMessage"
#      - emit:
#          channel: "user_uttered"
#          data: {"message": "Bonjour", "session_id": "{{ sessionId }}"}
#      - think: 60
#
#  - name: "A chatty user"
#    weight: 0
#    engine: "socketio"
#    flow:
#      - emit:
#          channel: "session_request"
#          data: {session_id: null}
#      - loop:
#          - function: "setMessage"
#          - emit:
#              channel: "user_uttered"
#              data: {"message": "Bonjour", "session_id": "{{ sessionId }}"}
#          - think: 10
#        count: 10