test/artillery/simple-load-test.yaml
config:
  target: "https://chatbot.laine.xyz"
  socketio:
    path: "/socket-chatbot"
    transports: [ "websocket" ]
  phases:
    - duration: 1
      arrivalRate: 1
  engines:
    socketio-v3: { }
  processor: "./functions.js"

scenarios:
  - name: "Connect and send a bunch of messages"
    engine: socketio-v3
    flow:
      - think: 1
      - emit:
          channel: "session_request"
          data: {session_id: null}
      - think: 1
      - loop:
          - emit:
              channel: "user_uttered"
              data: { "message": "Bonjour", "session_id": "{{ getUuid }}" }
              response:
                channel: "bot_uttered"
          - think: 1
        count: 1